[
    {
        "abstrat": "On Monday, January 9, Tech.eu and Novobrief will share our new full-year data on venture capital activity across Europe, with a focus on ...",
        "abstrat_details": "On Monday, January 9, Tech.eu and Novobrief will share our new full-year data on venture capital activity across Europe, with a focus on Spain, and our outlook for 2017. We'll also include a short panel discussion with founders from local tech companies who have successfully raised venture capital. This will be followed up with drinks and networking at the same location. We are personally inviting leaders across Madrid's tech scene, so this is an event you won't want to miss!\n\nThe agenda:\n\n- Introduction from Robin Wauters, founder and editor of Tech.eu\n\n- Trends in European venture capital, from Shaheen Samavati, data analyst and reporter at Tech.eu\n\n- The VC landscape in Spain, from Alex Barrera, partner at Tech.eu, and chief WOWness officier at Press42\n\n- Founders of Spanish tech companies talk about their experiences raising financing, moderated by: Jaime Novoa, founder of Novobrief and analyst at K Fund. Featuring: Ander Michelena, CEO of Ticketbis (aquired by Stubhub/Ebay in May); Alejandro Artacho, CEO of Spotahome; Eduardo Fernández, CEO of ShuttleCloud; and Ben Askew-Renaut, CEO of Packlink.\n\n- Drinks and networking\n\nAbout Tech.eu\n\nTech.eu is Europe's top online source for technology news, data analysis and market intelligence. If you haven't already, make sure to sign up for our weekly newsletter and podcast series to keep up on the latest in European tech and venture capital. \n\nIf you have a funding announcement or other significant tech industry news and would like to be featured in our newsletter and/or podcast, please email shaheen@tech.eu.\n\nAbout Novobrief\n\nNovobrief is an English language publication covering the Spanish startup ecosystem.",
        "date": "2017-01-09T18:00:00Z",
        "location": {
            "lat": 40.41249699999999,
            "lng": -3.7182264000000487,
            "name": "Campus Madrid",
            "notes": "Auditorium"
        },
        "price": {
            "details": "Unknown",
            "isFree": false
        },
        "source": {
            "event_url": "https://www.campus.co/madrid/en/events/ag1zfmd3ZWItY2FtcHVzcj8LEgZDYW1wdXMiBFJvb3QMCxIGQ2FtcHVzIgZtYWRyaWQMCxIFRXZlbnQiEmExOWowMDAwMDAxVFZvSUFBVww",
            "logo": "http://tetuanvalley.com/wp-content/uploads/2016/03/opengraph-768x403.jpg",
            "name": "Campus Madrid",
            "url": "http://campus.co/madrid"
        },
        "target_url": "https://www.eventbrite.com/e/the-state-of-spanish-and-european-vc-with-techeu-and-novobrief-tickets-30325084143",
        "title": "The state of Spanish and European VC with Tech.eu and Novobrief",
        "id": "e657b12e-8728-41fe-9e88-a2939ccc43d1"
    },
    {
        "abstrat": "Actualizar una aplicación es una acción frecuente según le vas dotando de mayor funcionalidad y por supuesto quieres que siempre esté ...",
        "abstrat_details": "Actualizar una aplicación es una acción frecuente según le vas dotando de mayor funcionalidad y por supuesto quieres que siempre esté disponible para tus usuarios finales. Los usuarios son críticos para ti y tu quieres ser capaz de desplegar nuevas versiones de tu aplicación sin afectarles lo más mínimo. En esta charla enseñaré como crear una aplicación pensando zero down-time. La aplicación estará funcionando en OpenShift y será actualizada sin afectar a los usuarios finales. También os describiré que consideraciones hay que tener y cómo utilizar las herramientas disponibles para poder hacer Continuous Deployment de vuestra aplicación.Ponente:Jorge Morales, Field Product Manager de OpenShift y Developer Advocate. Interesado en interactuar con clientes y usuarios de nuestra tecnología para entender como poder mejorarla. Desarrollador Java durante muchos años aunque últimamente me estoy volviendo políglota. Apasionado del cloud y del mundo DevOps, siempre he estado intentando que los desarrolladores sientan producción muy cercana. Cuando no viajo intento disfrutar de la familia sin más hobbies que ellos.",
        "date": "2017-01-11T19:00:00Z",
        "location": {
            "lat": 40.41249699999999,
            "lng": -3.7182264000000487,
            "name": "Campus Madrid",
            "notes": "Auditorium"
        },
        "price": {
            "details": "Unknown",
            "isFree": false
        },
        "source": {
            "event_url": "https://www.campus.co/madrid/en/events/ag1zfmd3ZWItY2FtcHVzcj8LEgZDYW1wdXMiBFJvb3QMCxIGQ2FtcHVzIgZtYWRyaWQMCxIFRXZlbnQiEmExOWowMDAwMDAxVDBwMEFBQww",
            "logo": "http://tetuanvalley.com/wp-content/uploads/2016/03/opengraph-768x403.jpg",
            "name": "Campus Madrid",
            "url": "http://campus.co/madrid"
        },
        "target_url": "https://www.meetup.com/es/meetup-group-lAoZvyGw/events/235877104/?eventId=235877104",
        "title": "Diseñar tus aplicaciones pensando en actualizaciones con zero down-time.",
        "id": "e9cdbd39-9ff0-4933-8fc8-5eea6a096429"
    },
    {
        "abstrat": "New at Campus? Want to know more about how to get the most out of it and meet other female entrepreneurs?Every second Thursday of each ...",
        "abstrat_details": "New at Campus? Want to know more about how to get the most out of it and meet other female entrepreneurs?Every second Thursday of each month at 1pm women ambassadors from the Campus community invite you to join them at the Campus Café to answer your questions and help you make great connections. No signup needed!Coffee and cake is on us! :)",
        "date": "2017-01-12T13:00:00Z",
        "location": {
            "lat": 40.41249699999999,
            "lng": -3.7182264000000487,
            "name": "Campus Madrid",
            "notes": "Cafe Floor 1"
        },
        "price": {
            "details": "Unknown",
            "isFree": false
        },
        "source": {
            "event_url": "https://www.campus.co/madrid/en/events/ag1zfmd3ZWItY2FtcHVzcj8LEgZDYW1wdXMiBFJvb3QMCxIGQ2FtcHVzIgZtYWRyaWQMCxIFRXZlbnQiEmExOWowMDAwMDAxU202ZkFBQww",
            "logo": "http://tetuanvalley.com/wp-content/uploads/2016/03/opengraph-768x403.jpg",
            "name": "Campus Madrid",
            "url": "http://campus.co/madrid"
        },
        "target_url": null,
        "title": "Campus Community: Women Welcome",
        "id": "ef3c8cf6-dafc-4fcc-8c14-e43525ffc14a"
    },
    {
        "abstrat": "El único evento exclusivamente dedicado a los nuevos dominios de Internet. Escucha a los mejores expertos en Internet, marketing digital, ...",
        "abstrat_details": "El único evento exclusivamente dedicado a los nuevos dominios de Internet. Escucha a los mejores expertos en Internet, marketing digital, ...Pon mas Dominios en tu Startup!Estás interesado en saber cómo puedes usar los nuevos Dominios para mejorar el marketing y la presencia online ? Expertos en esta materia te enseñarán: *   ¿Cuáles son los nuevos dominios disponibles?*   ¿A quién se dirigen y quién puede registrarlos?*   ¿Cómo ayudan a mejorar la presencia online?*   ¿Cómo se pueden usar en las campañas de marketing?*   ¿Qué impacto van a tener en el comercio electrónico?*   ¿Cuál es la mejor estrategia para registrar nuevos dominios?*   ¿Qué extensiones interesan a cada tipo de negocio?*   ¿Qué hacer y qué no hacer con un nuevo dominio?*   ¿Qué están haciendo ya otras empresas con estos dominios?Keynote Speaker: Jesús Alonso GalloFundador de Restaurantes.comDe empleado en serie a emprendedor en serie, de emprendedor en serie a inversor en serie.",
        "date": "2017-01-13T09:30:00Z",
        "location": {
            "lat": 40.41249699999999,
            "lng": -3.7182264000000487,
            "name": "Campus Madrid",
            "notes": "Auditorium"
        },
        "price": {
            "details": "Unknown",
            "isFree": false
        },
        "source": {
            "event_url": "https://www.campus.co/madrid/en/events/ag1zfmd3ZWItY2FtcHVzcj8LEgZDYW1wdXMiBFJvb3QMCxIGQ2FtcHVzIgZtYWRyaWQMCxIFRXZlbnQiEmExOWowMDAwMDAxU2wyUkFBUww",
            "logo": "http://tetuanvalley.com/wp-content/uploads/2016/03/opengraph-768x403.jpg",
            "name": "Campus Madrid",
            "url": "http://campus.co/madrid"
        },
        "target_url": "http://www.thename.show/madrid/",
        "title": "TheName SHOW Madrid",
        "id": "043b07f4-c25c-4b1f-9652-61535c91f929"
    },
    {
        "abstract": "Are you working on an exciting tech product and are interested in joining of the TechHub community? We'd love to meet you - come visit us at Campus Madrid and see what being a TechHub member is all about!\n \nOur team will make you a tea/coffee, show you the TechHub space, and talk to you about:\n\nMembership structure and costs, and what the best membership combination is for you and your team\nWhat’s included in the membership and how we support our members through events, community initiatives and",
        "abstract_details": "Are you working on an exciting tech product and are interested in joining of the TechHub community? We'd love to meet you - come visit us at Campus Madrid and see what being a TechHub member is all about!\n \nOur team will make you a tea/coffee, show you the TechHub space, and talk to you about:\n\nMembership structure and costs, and what the best membership combination is for you and your team\nWhat’s included in the membership and how we support our members through events, community initiatives and our international support network (connecting members to potential collaborators, partners, employees and investors)\nThe TechHub application criteria and process (who we accept, what information you need to give and how long it takes to process applications)\nAnswer any other questions you have about how we can help your startup or how you can collaborate with TechHub\n\n\nYou're also welcome to bring your colleagues - please make sure they register for the tour via this Eventbrite page by forwarding them the link ;) If you are running late or need to cancel, please email us on membership.madrid@techhub.com\n¡Hasta pronto!",
        "date": "2017-01-11T11:00:00Z",
        "location": {
            "lat": 40.41263300000001,
            "lng": -3.718321899999978,
            "name": "TechHub Madrid, Madrid",
            "notes": false
        },
        "price": {
            "details": false,
            "isFree": true
        },
        "source": {
            "event_url": "https://www.eventbrite.es/e/entradas-visit-techhub-madrid-30461181213",
            "logo": "https://eventbrite-s3.s3.amazonaws.com/marketing/landingpages/shared/images/eb-logo.png",
            "name": "Evenbrite",
            "url": "https://www.eventbrite.es"
        },
        "target_url": "https://www.eventbrite.es/e/entradas-visit-techhub-madrid-30461181213",
        "title": "Visit TechHub Madrid",
        "id": "7dec5439-f994-4c86-ab7d-6c057865d20e"
    },
    {
        "abstract": "Dear data lovers! These days of festivities seem to be finally wearing off and your usual routing starts to take over soon… And your usual routine includes, of course, attending a Databeers event! So, lest you have the withdrawal syndrome, we are back!\n\nThis time we have a Databeers Branded Event organized jointly with Telefónica, who provides the content and the venue & beers for your sheer enjoyment of their data stories. We will meet at 19:00 at the Ágora Wayra in the Telefónica building at C",
        "abstract_details": "Dear data lovers! These days of festivities seem to be finally wearing off and your usual routing starts to take over soon… And your usual routine includes, of course, attending a Databeers event! So, lest you have the withdrawal syndrome, we are back!\n\nThis time we have a Databeers Branded Event organized jointly with Telefónica, who provides the content and the venue & beers for your sheer enjoyment of their data stories. We will meet at 19:00 at the Ágora Wayra in the Telefónica building at Calle Gran Vía 28 planta 8ª (entrance is in calle Valverde 2). Important! Please note that Telefónica requires attendees to indicate their national IDs when reserving the ticket and to show their IDs at the entrance (so we’ll ask for it in the Eventbrite form).\n\nPlease register here for the event!\n\nOur data speakers lineup is as follows:\n\nPedro López Fernández, Lead Data Scientist - Drivies (Telefónica I+D), title TBD\nJavier Carro Calabor, (Data Analyst - LUCA) - Commuter Traffic: Can Big Data solve the problem?\nCarlos Olmos & Alberto Santos, Urban Data Analytics, title TBD\nJuan Luis Cano, Synergic Partners, @astrojuanlu, \"Kitt, esquiva a ese peatón”\nTomás Morales, Synergic Partners, title TBD\n\nSpread the word, be data and bring your friends, because as you know the more the merrier!",
        "date": "2017-01-12T07:00:00Z",
        "location": {
            "lat": 40.4204889,
            "lng": -3.702173499999958,
            "name": "Ágora Wayra (Edificio Telefónica, planta 8), Madrid",
            "notes": false
        },
        "price": {
            "details": false,
            "isFree": true
        },
        "source": {
            "event_url": "https://www.eventbrite.es/e/entradas-databeers-branded-event-telefonica-30903885353",
            "logo": "https://eventbrite-s3.s3.amazonaws.com/marketing/landingpages/shared/images/eb-logo.png",
            "name": "Evenbrite",
            "url": "https://www.eventbrite.es"
        },
        "target_url": "https://www.eventbrite.es/e/entradas-databeers-branded-event-telefonica-30903885353",
        "title": "Databeers Branded Event - Telefónica",
        "id": "85287f98-43cb-4d85-99e3-8f12c01a7306"
    },
    {
        "abstract": "Resumen\n\nEste curso ofrece una introducción avanzada a tres estilos de programación soportados y promovidos por la programación funcional: la programación genérica, la programación aplicativa y la programación monádica. El curso también introduce el papel que juegan las álgebras en la programación funcional, y los dos estilos de programación algebraica principales: basados en type classes y basados en F-algebras, transformaciones naturales, tipos algebraicos de datos generalizados, etc. Durante ",
        "abstract_details": "Resumen\n\nEste curso ofrece una introducción avanzada a tres estilos de programación soportados y promovidos por la programación funcional: la programación genérica, la programación aplicativa y la programación monádica. El curso también introduce el papel que juegan las álgebras en la programación funcional, y los dos estilos de programación algebraica principales: basados en type classes y basados en F-algebras, transformaciones naturales, tipos algebraicos de datos generalizados, etc. Durante el curso utilizaremos Scala y su fantástico ecosistema de librerías para la programación funcional, concretamente, shapeless y las librerías de type classes scalaz y cats. Con una menor relevancia, en el curso también se hará mención a la librería de pruebas Scalacheck. Para cada uno de estos tres estilos de programación, se describirán los problemas más relevantes para los que están pensados, sus abstracciones constituyentes y el soporte que ofrecen para ellos las librerías del ecosistema de Scala.\n\nObjetivos\n\nEncuadrar los tres estilos de programación estudiados durante el curso como parte del catálogo de técnicas de modularidad proporcionadas por la programación funcional\nEntender los patrones de diseño utilizados por Cats y Scalaz en la implementación de la signatura, leyes, operaciones derivadas, instancias y sintaxis de las type classes incluidas en dichas librerías.\nInstanciar las type classes monádicas más comunes (MonadState, MonadError, etc.) con los transformadores de mónadas correspondientes (StateT, EitherT, etc.), y entender cómo funcionan dichos transformadores.\nEntender el papel que desempeñan las algebras en la programación funcionaln como especificaciones de DSLs, y las distintas formas de representarlas: con tipos algebraicos de datos (F-Algebras) y mediante type classes (Ojbect-algebras).\nUtilizar tipos algebraicos de datos generalizados, transformaciones naturales y Free monads para diseñar DSLs, y saber cuándo utilizar estas representaciones en lugar de las basadas en Church encodings y álgebras de objetos.\nEntender las diferencias entre los estilos aplicativo y monádico (es decir, imperativo), sus principales aplicaciones y el soporte que ofrecen scalaz y cats para ellos\nEntender el concepto de representación libre (\"free structures\") y su aplicación al diseño de lenguajes aplicativos y monádicos\nEntender el papel de las listas heterogéneas (HList) y los coproductos para abstraer la forma particular de los tipos algebraicos de datos (ADTs), y poder de esa forma implementar algoritmos genéricos que trabajen a ese nivel de abstracción (por ejemplo, para derivar automáticamente type classes). ¡Todo ello utilizando shapeless!\nEntender la arquitectura interna de shapeless, cats y scalaz, así como las técnicas de Scala más avanzadas utilizadas en su diseño\n¡Aprender más programación funcional por uno mismo!\n\nTemario\n\nType class libraries: Scalaz & Cats\n\nScalaz & Cats overview\nType classes: Monad, MonadState, MonadError, etc.\nMonad transformers: StateT, EitherT, etc.\n\n\nAlgebras and functional programming\n\nF-algebras and object-algebras\nGADTs and natural transformations\nFree structures: free monoids and free monads\n\n\nApplicative programming\n\nApplicative functors\nTraversables\nFree applicatives\n\n\nDatatype generic programming\n\nShapeless architecture\nHList, Coproduct and Fix\nAutomatic type class derivation\n\n\n\nAudiencia\nEste curso está especialmente dirigido a ti si:\n\nProgramadores de Scala con conocimientos intermedios de programación funcional, deseosos de mejorar su conocimiento de este paradigma y poder utilizar shapeless, scalaz, cats, y otras librerías igualmente avanzadas del ecosistema de Scala, en su código de producción\nProgramadores con un conocimiento profundo de programación funcional, con ganas de saber cómo se aplican dichos conocimientos con Scala y su ecosistema de librerías\n\nMás información en ... \nhttp://www.hablapps.com/index.html#functional-advanced-es",
        "date": "2017-01-13T04:00:00Z",
        "location": {
            "lat": 40.3543998,
            "lng": -3.7462984999999662,
            "name": "Parque Científico Universidad Carlos III de Madrid, Leganés, Madrid",
            "notes": false
        },
        "price": {
            "details": "275 € – 550 €",
            "isFree": false
        },
        "source": {
            "event_url": "https://www.eventbrite.es/e/entradas-programacion-funcional-avanzada-con-scala-2a-ed-29668373905",
            "logo": "https://eventbrite-s3.s3.amazonaws.com/marketing/landingpages/shared/images/eb-logo.png",
            "name": "Evenbrite",
            "url": "https://www.eventbrite.es"
        },
        "target_url": "https://www.eventbrite.es/e/entradas-programacion-funcional-avanzada-con-scala-2a-ed-29668373905",
        "title": "Programación funcional avanzada con Scala (2ª ed.)",
        "id": "13c92b6c-414a-4ab2-aa50-52a96f1c8cec"
    }
]